START_TEXT = "Привет, друг! Рад видеть тебя на “Полюсе знаний”. Давай проверим, что ты реальный человек."
ID_ERROR_TEXT = "На этом форуме может быть только один робот - это я. Кажется, ты ввел неверный код. Попробуй еще раз."
HELP_TEXT = \
"""
Давай знакомиться! Я – Полюс, пес будущего и твой проводник в мир современных технологий и инновации!
Я люблю гонять компьютерные вирусы и местных котов, помогать детям и взрослым, получать вкусняшки от своей зарядной станции и танцевать.
На протяжении всего мероприятия я буду рядом, ведь робот-собака – лучший друг человека!

Что я умею:
- Показывать расписание
- Напоминать тебе о начале событий
- Рассказывать интересные и полезные факты о форуме
- Записывать на воркшопы
- Держать связь с администраторами
"""
ACQUAINTANCE_TEXT = "Пожалуйста, введи код, который тебе предоставил волонтер при регистрации на форум."
ADMINISTRATOR_ACCESS_ERROR = "У Вас недостаточно прав для выполнения данного действия!"
MENU_TEXT = "Здесь я собрал всю самую важную информацию. Что тебя интересует?"
PLACE_FOR_WORKSHOP_ENDS = "Места на воркшопы кончаются быстрее, чем куриные подушечки в мисках моих лохматых друзей. Если ты еще не записался, то поторопись!"
TIMETABLE_TITLE_TEXTS = [
    "Программа форума такая насыщенная… И как все успеть? Смотри расписание! Здесь указаны локации и время старта мероприятий.",
    "А вот расписание твоего дня. Не пропусти интересные события!",
    "Да, все в голове не уместить… Как хорошо, что я всегда у тебя под рукой и подскажу расписание"
]
SUPPORT_TEXT = "К сожалению, собаки не могут знать все. Пожалуйста, напиши свой вопрос, а я передам его тем, кто наверняка тебе поможет!"

NOTIFY_PATTERN_TEXT = \
"""1) <code>Хэй! Я жду тебя на открытии нашего невероятного форума. Уже не терпится тебя увидеть! Приходи в /место/ через /0 минут/. Я даже нарисовал для тебя карту! /карта с локацией/</code>

2) <code>Тик-так, тик-так. Через /0 минут/ начнется /название мероприятия/. Не пропусти! Если заблудился, то взгляни на карту /карта/</code>

3) <code>Я тут разнюхал, что в /локация/ проходит интереснейшее /мероприятие/. Начало в /время/карта/</code>

4) <code>Все двуногие куда-то побежали. Кажется, начинается /мероприятие/. Ты уже тут?</code>"""
